<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"165830f16735d39bc07fff41d3b34e1d5af05d2625e6a60213e78476e5c58861","plan_job_ref":"Job Create MPE Management terraform plan #21 at https://github.com/AFMPE/mpe_management/actions/runs/4756737913","plan_hash":"a890918e7794082e44186ff2932d0bd0d0dd90ebbd128917fbf09a6989dc2983","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 10 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.mod_management_groups[0].time_sleep.after_azurerm_management_group will be created
  + resource "time_sleep" "after_azurerm_management_group" {
      + create_duration  = "30s"
      + destroy_duration = "0s"
      + id               = (known after apply)
      + triggers         = {
          + "azurerm_management_group" = jsonencode(
                [
                  + "management_groups",
                ]
            )
        }
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

  # module.mod_management_groups[0].module.mod_management_group.azurerm_management_group.level_1["/providers/Microsoft.Management/managementGroups/ampe"] will be created
  + resource "azurerm_management_group" "level_1" {
      + display_name               = "ampe"
      + id                         = (known after apply)
      + name                       = "ampe"
      + parent_management_group_id = "*************************************************************************************"
      + subscription_ids           = (known after apply)
    }

  # module.mod_management_groups[0].module.mod_management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/platforms"] will be created
  + resource "azurerm_management_group" "level_2" {
      + display_name               = "platforms"
      + id                         = (known after apply)
      + name                       = "platforms"
      + parent_management_group_id = "*****************************************************"
      + subscription_ids           = (known after apply)
    }

  # module.mod_management_groups[0].module.mod_management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/sandbox"] will be created
  + resource "azurerm_management_group" "level_2" {
      + display_name               = "sandbox"
      + id                         = (known after apply)
      + name                       = "sandbox"
      + parent_management_group_id = "*****************************************************"
      + subscription_ids           = (sensitive value)
    }

  # module.mod_management_groups[0].module.mod_management_group.azurerm_management_group.level_2["/providers/Microsoft.Management/managementGroups/workloads"] will be created
  + resource "azurerm_management_group" "level_2" {
      + display_name               = "workloads"
      + id                         = (known after apply)
      + name                       = "workloads"
      + parent_management_group_id = "*****************************************************"
      + subscription_ids           = (known after apply)
    }

  # module.mod_management_groups[0].module.mod_management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/internal"] will be created
  + resource "azurerm_management_group" "level_3" {
      + display_name               = "internal"
      + id                         = (known after apply)
      + name                       = "internal"
      + parent_management_group_id = "**********************************************************"
      + subscription_ids           = (sensitive value)
    }

  # module.mod_management_groups[0].module.mod_management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/partners"] will be created
  + resource "azurerm_management_group" "level_3" {
      + display_name               = "partners"
      + id                         = (known after apply)
      + name                       = "partners"
      + parent_management_group_id = "**********************************************************"
      + subscription_ids           = (sensitive value)
    }

  # module.mod_management_groups[0].module.mod_management_group.azurerm_management_group.level_3["/providers/Microsoft.Management/managementGroups/transport"] will be created
  + resource "azurerm_management_group" "level_3" {
      + display_name               = "transport"
      + id                         = (known after apply)
      + name                       = "transport"
      + parent_management_group_id = "**********************************************************"
      + subscription_ids           = (sensitive value)
    }

  # module.mod_management_groups[0].module.mod_management_group.time_sleep.after_azurerm_management_group will be created
  + resource "time_sleep" "after_azurerm_management_group" {
      + create_duration  = "40s"
      + destroy_duration = "0s"
      + id               = (known after apply)
      + triggers         = {
          + "azurerm_management_group_level_1" = jsonencode(
                [
                  + "/providers/Microsoft.Management/managementGroups/ampe",
                ]
            )
          + "azurerm_management_group_level_2" = jsonencode(
                [
                  + "/providers/Microsoft.Management/managementGroups/platforms",
                  + "/providers/Microsoft.Management/managementGroups/sandbox",
                  + "/providers/Microsoft.Management/managementGroups/workloads",
                ]
            )
          + "azurerm_management_group_level_3" = jsonencode(
                [
                  + "/providers/Microsoft.Management/managementGroups/internal",
                  + "/providers/Microsoft.Management/managementGroups/partners",
                  + "/providers/Microsoft.Management/managementGroups/transport",
                ]
            )
          + "azurerm_management_group_level_4" = jsonencode([])
          + "azurerm_management_group_level_5" = jsonencode([])
          + "azurerm_management_group_level_6" = jsonencode([])
        }
    }

  # module.mod_management_groups_budgets[0].module.mod_mpe_mg_budgets.azurerm_consumption_budget_management_group.mg_budget will be created
  + resource "azurerm_consumption_budget_management_group" "mg_budget" {
      + amount              = 14000
      + etag                = (known after apply)
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + name                = "MPE Workloads Budget"
      + time_grain          = "Monthly"

      + notification {
          + contact_emails = [
              + "ampe@missionpartners.us",
            ]
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 90
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = "2024-04-01T00:00:00Z"
          + start_date = "2023-03-01T00:00:00Z"
        }
    }

Plan: 10 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #21](https://github.com/AFMPE/mpe_management/actions/runs/4756737913)